#language: ru
Функция: Исчисление

    Сценарий: Максимальная цена + цвет
      * Страница загружена
      * Выполнено нажатие на кнопку "Электроника"
      * Страница загружена
      * Выполнено нажатие на кнопку "Ноутбуки и планшеты"
      * Приостановлено выполнение на 5 секунд
      * Выполнено нажатие на кнопку "Игровые ноутбуки"
      * Приостановлено выполнение на 5 секунд
      * Выполнено нажатие на кнопку "Просмотреть все бренды"
      * Приостановлено выполнение на 3 секунд
      * Отметить следующие элементы:
        |MSI  |
      #  |Razer|  MSI почему-то нельзя выбрать одновременно с Razer, один из вариантов пропадает, если выбрать другой
      * Приостановлено выполнение на 5 секунд
      #* В списке "Сортировка по" выбран вариант "Сначала дорогие"
      * Выполнено нажатие на кнопку "Сортировка по"
      * Страница загружена
      * Выполнено нажатие на клавишу "DOWN" в поле "Сортировка по"
      * Выполнено нажатие на клавишу "DOWN" в поле "Сортировка по"
      * Выполнено нажатие на клавишу "DOWN" в поле "Сортировка по"
      * Выполнено нажатие на клавишу "ENTER" в поле "Сортировка по"
      * Приостановлено выполнение на 3 секунд
      * Сохранено значение 1 поля в коллекции "Результаты поиска: Цены"
      * Выполнено нажатие на 1 поле в коллекции "Результаты поиска: Цены"
      * Страница загружена
      * Значение поля "Цена" совпадает с сохранённым значением
      * Вывести дополнительную информацию